// ---------------------------------------- 
// ---------------------------------------- 
// ------------------ 





// ---------------------------------------- 
// ---------------------------------------- 
// ------------------ 
function get_tarot_text_1(idx) {return tarot_texts_1[idx]; }

function get_tarot_title (idx) {return tarot_titles[idx]; }

function get_card_info   (idx) {return tc_infos[idx]; }


// ---------------------------------------- 
// ---------------------------------------- 
// ------------------ 
const OneCard_description = '\n\
<h3>오늘을 위한 카드 (1장)</h3>\n\
\
<p>당신이 어떤 상황에 있든 그 상황에 대한 해결책을 얻기 위한 혹은 그 날의 명상을 위한 카드이다. </p>\n\
\
<p class="hanging_18">1. 자신의 궁금한 상황을 상상하며, 멈추고 싶을 때 카드 뒷면을 누른다.</p>\n\
<p class="hanging_18">2. 나타난 카드 그림을 누르고, 카드에 대한 설명을 읽는다.</p>\n\
<p class="hanging_18">3. 다시 하고 싶다면, 상단의 [1장] 버튼을 누른 후 1, 2 순서대로 다시 한다.  </p>\n\
';


const FourCard_description = '\n\
\
<h3>관계를 위한 카드 (4장)</h3>\n\
\
<p>당신의 상대가 연인, 친구, 형제, 부모, 직장 상사이든 상관없이 그 상대와의 관계를 살펴 볼 수 있다.</p>\n\
\
 <p class="hanging_18">1. 당신 자신을 상상하고, 1번 카드 뒷면을 누른다. </p>\n\
 <p class="hanging_18">2. 상대방을 상상하고, 2번 카드 뒷면을 누른다. </p>\n\
 <p class="hanging_18">3. 3번, 4번 카드 뒷면을 순서대로 누른다. </p>\n\
 <p class="hanging_18">4. 각 카드에 나타난 그림을 누르고, 각 카드에 대한 설명을 읽는다. </p>\n\
 <p class="hanging_18">5. 자신이 뽑은 배치도로 돌아가고 싶으면, 각 카드의 그림을 다시 누른다.</p>\n\
 <p class="hanging_18">6. 처음부터 다시 하고 싶다면, 상단의 [4장] 버튼을 누른 후 1에서 4번 순서대로 한다.</p>\n\
  \n\
  \n\
<table class="tbl " style=""  >\n\
  <tr> <th> <b>카드</b> </th> <th> <b>의미</b> </th>  </tr>\n\
  <tr> <td class="tbl_num"> 1 </td> <td>당신-당신이 지금 여기에서 관계에 미치는 영향 </td> </tr>\n\
  <tr> <td class="tbl_num"> 2 </td> <td>상대방-상대방이 관계에 미치는 영향 </td> </tr>\n\
  <tr> <td class="tbl_num"> 3 </td> <td>서로의 에너지 </td> </tr>\n\
  <tr> <td class="tbl_num"> 4 </td> <td>해결책</td> </tr>\n\
</table>\n\
';


// ---------------------------------------- 
// ---------------------------------------- 
// ------------------ 



